megamind4089/qmk_nrf52/tmk_core/protocol/nrf/sdk15/usbd.c
        HID_RI_END_COLLECTION(0),
    HID_RI_END_COLLECTION(0),
};

#undef CONCAT
#include "nrf.h"
#include "nrf_drv_usbd.h"
#include "nrf_drv_clock.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "nrf_drv_power.h"

#include "app_usbd.h"
#include "app_usbd_core.h"
#include "app_usbd_hid_mouse.h"
#include "app_usbd_hid_kbd.h"
#include "app_usbd_hid_generic.h"
#include "app_usbd_cdc_acm.h"
//#include "boards.h"

//#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"

#undef APP_USBD_HID_KBD_REPORT_DSC
#define APP_USBD_HID_KBD_REPORT_DSC() {                                                    \
        0x05, 0x01,                    /* USAGE_PAGE (Generic Desktop)                   */\
        0x09, 0x06,                    /* USAGE (Keyboard)                               */\
        0xa1, 0x01,                    /* COLLECTION (Application)                       */\
        0x05, 0x07,                    /*   USAGE_PAGE (Keyboard)                        */\
        0x19, 0xe0,                    /*   USAGE_MINIMUM (Keyboard LeftControl)         */\
        0x29, 0xe7,                    /*   USAGE_MAXIMUM (Keyboard Right GUI)           */\
        0x15, 0x00,                    /*   LOGICAL_MINIMUM (0)                          */\
        0x25, 0x01,                    /*   LOGICAL_MAXIMUM (1)                          */\
        0x75, 0x01,                    /*   REPORT_SIZE (1)                              */\
        0x95, 0x08,                    /*   REPORT_COUNT (8)                             */\
        0x81, 0x02,                    /*   INPUT (Data,Var,Abs)                         */\
        0x95, 0x01,                    /*   REPORT_COUNT (1)                             */\
        0x75, 0x08,                    /*   REPORT_SIZE (8)                              */\
        0x81, 0x03,                    /*   INPUT (Cnst,Var,Abs)                         */\
        0x95, 0x05,                    /*   REPORT_COUNT (5)                             */\
        0x75, 0x01,                    /*   REPORT_SIZE (1)                              */\
        0x05, 0x08,                    /*   USAGE_PAGE (LEDs)                            */\
        0x19, 0x01,                    /*   USAGE_MINIMUM (Num Lock)                     */\
        0x29, 0x05,                    /*   USAGE_MAXIMUM (Kana)                         */\
        0x91, 0x02,                    /*   OUTPUT (Data,Var,Abs)                        */\
        0x95, 0x01,                    /*   REPORT_COUNT (1)                             */\
        0x75, 0x03,                    /*   REPORT_SIZE (3)                              */\
        0x91, 0x03,                    /*   OUTPUT (Cnst,Var,Abs)                        */\
        0x95, 0x06,                    /*   REPORT_COUNT (6)                             */\
        0x75, 0x08,                    /*   REPORT_SIZE (8)                              */\
        0x15, 0x00,                    /*   LOGICAL_MINIMUM (0)                          */\
        0x25, 0xFF,                    /*   LOGICAL_MAXIMUM (255)                        */\
        0x05, 0x07,                    /*   USAGE_PAGE (Keyboard)                        */\
        0x19, 0x00,                    /*   USAGE_MINIMUM (Reserved (no event indicated))*/\
        0x29, 0xFF,                    /*   USAGE_MAXIMUM (Keyboard Application)         */\
        0x81, 0x00,                    /*   INPUT (Data,Ary,Abs)                         */\
        0xc0                           /* END_COLLECTION                                 */\
}

static bool auto_connection_check = false;
static int auto_connection_check_cnt = 0;

/**
 * @brief User event handler, HID mouse
 * */
static void hid_mouse_user_ev_handler(app_usbd_class_inst_t const * p_inst,
    app_usbd_hid_user_event_t event);

/**
 * @brief User event handler, HID keyboard
 * */
static void hid_kbd_user_ev_handler(app_usbd_class_inst_t const * p_inst,
    app_usbd_hid_user_event_t event);

/**
 * @brief Enable HID mouse class
 * */
#define CONFIG_HAS_MOUSE    1

/**
 * @brief Enable HID keyboard class
 * */
#define CONFIG_HAS_KBD      1

/**
 * @brief USB composite interface enumerator
 * */
enum {
  APP_USBD_INTERFACE_KBD=0,
  APP_USBD_INTERFACE_MOUSE,
  APP_USBD_INTERFACE_EXTRA,
  APP_USBD_INTERFACE_ABSMOUSE,
  APP_USBD_INTERFACE_CDC_ACM_COMM,
  APP_USBD_INTERFACE_CDC_ACM_DATA,
};

#define EXTRA_ENDPOINT_LIST()                                      \
(                                                            \
        NRF_DRV_USBD_EPIN3                                   \
)

#define ABS_MOUSE_ENDPOINT_LIST()                                      \
(                                                            \
        NRF_DRV_USBD_EPIN4                                   \
)
///**
// * @brief Mouse button count
// * */
//static uint8_t m_generic_rep_dsc[] = APP_USBD_HID_MOUSE_REPORT_DSC_BUTTON(MOUSE_BUTTON_COUNT);

static const app_usbd_hid_subclass_desc_t extra_dsc = {
  sizeof(ExtrakeyReport),
  APP_USBD_DESCRIPTOR_REPORT,
  ExtrakeyReport
};

static const app_usbd_hid_subclass_desc_t * reps[] = {&extra_dsc};

/**
 * @brief Number of reports defined in report descriptor
 */
#define EXTRA_REPORT_COUNT        1

/**
 * @brief Size of maximum output report. HID generic class will reserve
 *        this buffer size + 1 memory space. */
#define EXTRA_REPORT_OUT_MAXSIZE  0

/*lint -save -e26 -e64 -e123 -e505 -e651*/
#define REPORT_IN_QUEUE_SIZE    1
#define REPORT_OUT_MAXSIZE  0
#define HID_GENERIC_EP_COUNT  1

APP_USBD_HID_GENERIC_GLOBAL_DEF(m_app_hid_extra,
                                APP_USBD_INTERFACE_EXTRA,
                                hid_mouse_user_ev_handler,
                                EXTRA_ENDPOINT_LIST(),
                                reps,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_NONE,
                                APP_USBD_HID_PROTO_GENERIC);

static const app_usbd_hid_subclass_desc_t abs_mouse_dsc = {
  sizeof(AbsMouseReport),
  APP_USBD_DESCRIPTOR_REPORT,
  AbsMouseReport
};

static const app_usbd_hid_subclass_desc_t * abs_mouse_reps[] = {&abs_mouse_dsc};

APP_USBD_HID_GENERIC_GLOBAL_DEF(m_app_hid_abs_mouse,
                                APP_USBD_INTERFACE_ABSMOUSE,
                                hid_mouse_user_ev_handler,
                                ABS_MOUSE_ENDPOINT_LIST(),
                                abs_mouse_reps,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_NONE,
                                APP_USBD_HID_PROTO_GENERIC);
/*lint -save -e26 -e64 -e123 -e505 -e651*/

/**
 * @brief Global HID mouse instance
 * */
#define MOUSE_BUTTON_COUNT 5
/**
 * @brief Global HID keyboard instance
 * */
//APP_USBD_HID_MOUSE_GLOBAL_DEF(m_app_hid_mouse,
//                              APP_USBD_INTERFACE_MOUSE,
//                              NRF_DRV_USBD_EPIN2,
//                              MOUSE_BUTTON_COUNT,
//                              hid_mouse_user_ev_handler,
//                              APP_USBD_HID_SUBCLASS_BOOT
//);
static const app_usbd_hid_subclass_desc_t mouse_dsc = {
  sizeof(MouseReport),
  APP_USBD_DESCRIPTOR_REPORT,
  MouseReport
};

static const app_usbd_hid_subclass_desc_t * mouse_reps[] = {&mouse_dsc};

APP_USBD_HID_GENERIC_GLOBAL_DEF(m_app_hid_mouse,
                                APP_USBD_INTERFACE_MOUSE,
                                hid_mouse_user_ev_handler,
                                (NRF_DRV_USBD_EPIN2),
                                mouse_reps,
                                REPORT_IN_QUEUE_SIZE,
                                REPORT_OUT_MAXSIZE,
                                APP_USBD_HID_SUBCLASS_NONE,
                                APP_USBD_HID_PROTO_GENERIC);

/**
 * @brief Global HID keyboard instance
 */
APP_USBD_HID_KBD_GLOBAL_DEF(m_app_hid_kbd,
                            APP_USBD_INTERFACE_KBD,
                            NRF_DRV_USBD_EPIN1,
                            hid_kbd_user_ev_handler,
                            APP_USBD_HID_SUBCLASS_BOOT
);


static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
    app_usbd_cdc_acm_user_event_t event);

#define CDC_ACM_COMM_EPIN       NRF_DRV_USBD_EPIN6
#define CDC_ACM_DATA_EPIN       NRF_DRV_USBD_EPIN5
#define CDC_ACM_DATA_EPOUT      NRF_DRV_USBD_EPOUT2

/**
 * @brief CDC_ACM class instance
 * */
APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm, cdc_acm_user_ev_handler,
    APP_USBD_INTERFACE_CDC_ACM_COMM, APP_USBD_INTERFACE_CDC_ACM_DATA, CDC_ACM_COMM_EPIN,
    CDC_ACM_DATA_EPIN, CDC_ACM_DATA_EPOUT, APP_USBD_CDC_COMM_PROTOCOL_AT_V250);

