megamind4089/qmk_nrf52/tmk_core/protocol/nrf/sdk15/usbd.c
typedef struct {
  uint8_t* const buf;
  uint16_t widx, ridx, cnt;
  const uint16_t len;
} struct_queue;

#define USB_SERIAL_TX_QUEUE_SIZE 1024UL
#define USB_SERIAL_RX_QUEUE_SIZE 64
static uint8_t tx_buf[USB_SERIAL_TX_QUEUE_SIZE], rx_buf[USB_SERIAL_RX_QUEUE_SIZE];
struct_queue tx_queue={tx_buf, 0, 0, 0, USB_SERIAL_TX_QUEUE_SIZE},
    rx_queue={rx_buf, 0, 0, 0, USB_SERIAL_RX_QUEUE_SIZE};

static size_t push_queue(struct_queue *q, uint8_t dat) {
  if (q->cnt < q->len) {
    q->buf[q->widx++] = dat;
    q->widx %= q->len;
    q->cnt++;
    return 1;
  } else {
    return 0;
  }
}

static size_t pop_queue(struct_queue *q, uint8_t *dat) {
  if (q->cnt) {
    *dat = q->buf[q->ridx++];
    q->ridx %= q->len;
    q->cnt--;
    return 1;
  } else {
    return 0;
  }
}

#define READ_SIZE 1
static char m_rx_buffer[NRF_DRV_USBD_EPSIZE];
static char m_tx_buffer[NRF_DRV_USBD_EPSIZE];
static bool m_send_flag = 0;

static void usbd_send_cdc_acm_internal(void const* p_context, char const *buf, size_t len) {
  ret_code_t ret;
  if (!m_send_flag) {
    len = len & 0xFF;
    memcpy(m_tx_buffer, buf, len);
    ret = app_usbd_cdc_acm_write(&m_app_cdc_acm, m_tx_buffer, len);
    if (ret == NRF_SUCCESS) {
      m_send_flag = true;
    }
  } else {
    uint8_t *p = (uint8_t*)buf;
    while (len--) {
      push_queue(&tx_queue, *p++);
    }
  }
}

void usbd_send_cdc_acm(uint8_t *buf, uint8_t len) {
  usbd_send_cdc_acm_internal(NULL, (char const*)buf, len);
}

void usbd_send_cdc_acm_queued(struct_queue *q) {
  uint8_t buf[NRF_DRV_USBD_EPSIZE];
  uint8_t dat;
  uint8_t idx=0;
  while (idx<sizeof(buf) && pop_queue(q, &dat)==1) {
    buf[idx++] = dat;
  }
  usbd_send_cdc_acm(buf, idx);
}

#include "nrf_log_backend_serial.h"
#include "nrf_log_internal.h"

static void nrf_log_backend_cdc_acm_put(nrf_log_backend_t const * p_backend,
                                     nrf_log_entry_t * p_msg){
  nrf_log_backend_serial_put(p_backend, p_msg, (uint8_t*)m_tx_buffer,
                             NRF_DRV_USBD_EPSIZE, usbd_send_cdc_acm_internal);
}
static void nrf_log_backend_cdc_acm_flush(nrf_log_backend_t const * p_backend)
{
}

static void nrf_log_backend_cdc_acm_panic_set(nrf_log_backend_t const * p_backend)
{
}

const nrf_log_backend_api_t nrf_log_backend_cdc_acm_api = {
        .put       = nrf_log_backend_cdc_acm_put,
        .flush     = nrf_log_backend_cdc_acm_flush,
        .panic_set = nrf_log_backend_cdc_acm_panic_set,
};

/**
 * @brief User event handler @ref app_usbd_cdc_acm_user_ev_handler_t (headphones)
 * */
static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const * p_inst,
    app_usbd_cdc_acm_user_event_t event) {
  app_usbd_cdc_acm_t const * p_cdc_acm = app_usbd_cdc_acm_class_get(p_inst);

  switch (event) {
  case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN: {
    /*Setup first transfer*/
    ret_code_t ret = app_usbd_cdc_acm_read(&m_app_cdc_acm, m_rx_buffer,
    READ_SIZE);
    UNUSED_VARIABLE(ret);
    break;
  }
  case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
    m_send_flag = false;
    break;
  case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
    m_send_flag = false;
    if (tx_queue.cnt) {
      usbd_send_cdc_acm_queued(&tx_queue);
    }
    break;
  case APP_USBD_CDC_ACM_USER_EVT_RX_DONE: {
    // Echoback
    UNUSED_VARIABLE(p_cdc_acm);
    ret_code_t ret;
    uint8_t idx=0;
    size_t size = app_usbd_cdc_acm_rx_size(p_cdc_acm);
    while (size--) {
      push_queue(&rx_queue, m_rx_buffer[idx++]);
    }

    /*Get amount of data waiting*/
    size = app_usbd_cdc_acm_bytes_stored(p_cdc_acm);
    if (size) {
      size = NRF_DRV_USBD_EPSIZE > size ? size : NRF_DRV_USBD_EPSIZE;
      /* Fetch data until internal buffer is empty */
      ret = app_usbd_cdc_acm_read(&m_app_cdc_acm, m_rx_buffer, size);
      idx = 0;
      while (size--) {
        push_queue(&rx_queue, m_rx_buffer[idx++]);
      }
      UNUSED_VARIABLE(ret);
//      usbd_send_cdc_acm((uint8_t*) m_rx_buffer, size);
    }

    // wait next transfer
    ret = app_usbd_cdc_acm_read(&m_app_cdc_acm, m_rx_buffer,
    READ_SIZE);
    UNUSED_VARIABLE(ret);

    break;
  }
  default:
    break;
  }
}

int cdc_acm_byte_to_read() {
  return (int)rx_queue.cnt;
}

void cdc_acm_putc(char c) {
  usbd_send_cdc_acm((uint8_t*)&c, 1);
}

char cdc_acm_getc() {
  uint8_t dat=0;
  pop_queue(&rx_queue, &dat);
  return (char)dat;
}

/*lint -restore*/

/**
 * @brief Button debounce time
 *
 * Number of microseconds to wait after button press detection
 */
#define DEBOUNCE_DELAY 5000

#define LED_USB_RESUME     (0)
#define LED_USB_START      (1)
#define LED_HID_REP_IN     (2)
#define LED_HID_REP_OUT    (3)

#define BTN_MOUSE_X_POS    (0)
#define BTN_MOUSE_LEFT     (1)
#define BTN_KBD_SHIFT      (2)
#define BTN_KBD_LETTER     (3)

/**
 * @brief Enable power USB detection
 *
 * Configure if example supports USB port connection
 */
#ifndef USBD_POWER_DETECTION
#define USBD_POWER_DETECTION true
#endif

/**
 * @brief Mouse speed (value send via HID when board button is pressed).
 * */
#define PRESS_OFFSET (3)

//static void mouse_action(uint32_t button_state) {
//}
//
//static void kbd_action(uint32_t button_state) {
//}
//

extern uint16_t keyboard_led_stats;
static void kbd_status(void) {
	uint8_t led=0;
	led += app_usbd_hid_kbd_led_state_get(&m_app_hid_kbd, APP_USBD_HID_KBD_LED_NUM_LOCK) ? APP_USBD_HID_KBD_LED_NUM_LOCK : 0;
	led += app_usbd_hid_kbd_led_state_get(&m_app_hid_kbd, APP_USBD_HID_KBD_LED_CAPS_LOCK) ? APP_USBD_HID_KBD_LED_CAPS_LOCK : 0;
	led += app_usbd_hid_kbd_led_state_get(&m_app_hid_kbd, APP_USBD_HID_KBD_LED_SCROLL_LOCK) ? APP_USBD_HID_KBD_LED_SCROLL_LOCK : 0;
	led += app_usbd_hid_kbd_led_state_get(&m_app_hid_kbd, APP_USBD_HID_KBD_LED_COMPOSE) ? APP_USBD_HID_KBD_LED_COMPOSE : 0;
	led += app_usbd_hid_kbd_led_state_get(&m_app_hid_kbd, APP_USBD_HID_KBD_LED_KANA) ? APP_USBD_HID_KBD_LED_KANA : 0;
    keyboard_led_stats = led;
}


/**
 * @brief Class specific event handler.
 *
 * @param p_inst    Class instance.
 * @param event     Class specific event.
 * */
static void hid_mouse_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                      app_usbd_hid_user_event_t event)
{
    UNUSED_PARAMETER(p_inst);
    switch (event) {
        case APP_USBD_HID_USER_EVT_OUT_REPORT_READY:
            /* No output report defined for HID mouse.*/
            ASSERT(0);
            break;
        case APP_USBD_HID_USER_EVT_IN_REPORT_DONE:
            break;
        default:
            break;
    }
}

int usbd_send_keyboard_buffered(app_usbd_hid_kbd_t const *  p_kbd);
void usbd_clear_sending_flag();
/**
 * @brief Class specific event handler.
 *
 * @param p_inst    Class instance.
 * @param event     Class specific event.
 * */
static void hid_kbd_user_ev_handler(app_usbd_class_inst_t const * p_inst,
                                    app_usbd_hid_user_event_t event)
{
    UNUSED_PARAMETER(p_inst);
    switch (event) {
        case APP_USBD_HID_USER_EVT_OUT_REPORT_READY:
            /* Only one output report IS defined for HID keyboard class. Update LEDs state. */
            kbd_status();
            break;
        case APP_USBD_HID_USER_EVT_IN_REPORT_DONE:
            usbd_clear_sending_flag();
            NRF_LOG_DEBUG("APP_USBD_HID_USER_EVT_IN_REPORT_DONE");
            usbd_send_keyboard_buffered(&m_app_hid_kbd);
            break;
        default:
            break;
    }
}


/**
 * @brief USBD library specific event handler.
 *
 * @param event     USBD library event.
 * */
static void usbd_user_ev_handler(app_usbd_event_type_t event)
{
    switch (event)
    {
        case APP_USBD_EVT_DRV_SOF:
            break;
        case APP_USBD_EVT_DRV_SUSPEND:
            app_usbd_suspend_req(); // Allow the library to put the peripheral into sleep mode
            NRF_LOG_DEBUG("APP_USBD_EVT_DRV_SUSPEND");
            auto_connection_check = true;
            break;
        case APP_USBD_EVT_DRV_RESUME:
            kbd_status(); /* Restore LED state - during SUSPEND all LEDS are turned off */
            break;
        case APP_USBD_EVT_STARTED:
            break;
        case APP_USBD_EVT_STOPPED:
            app_usbd_disable();
            NRF_LOG_DEBUG("USB disable");
            auto_connection_check = true;
            break;
        case APP_USBD_EVT_POWER_DETECTED:
            NRF_LOG_DEBUG("USB power detected");
            if (!nrf_drv_usbd_is_enabled())
            {
                app_usbd_enable();
                NRF_LOG_INFO("USB enable");
            }
#ifdef RGBLIGHT_ENABLE
//            rgblight_enable_noeeprom();
//            rgblight_mode_noeeprom(35);
#endif
            break;
        case APP_USBD_EVT_POWER_REMOVED:
            NRF_LOG_INFO("USB power removed");
            app_usbd_stop();
#ifdef RGBLIGHT_ENABLE
//            rgblight_disable();
#endif
            break;
        case APP_USBD_EVT_POWER_READY:
            NRF_LOG_DEBUG("USB ready");
            app_usbd_start();
            break;
        default:
            break;
    }
}

