megamind4089/qmk_nrf52/tmk_core/protocol/nrf/sdk15/usbd.c
int usbd_init(void) {
  ret_code_t ret;
  static const app_usbd_config_t usbd_config = {
      .ev_state_proc = usbd_user_ev_handler,
  };
//
  ret = nrf_drv_clock_init();
  APP_ERROR_CHECK(ret);

  ret = app_usbd_init(&usbd_config);
  APP_ERROR_CHECK(ret);

  NRF_LOG_DEBUG("Hello USB!\r\n");

  app_usbd_class_inst_t const * class_inst_kbd;
  class_inst_kbd = app_usbd_hid_kbd_class_inst_get(&m_app_hid_kbd);
  ret = app_usbd_class_append(class_inst_kbd);
  APP_ERROR_CHECK(ret);
  ret = app_usbd_class_rwu_register(class_inst_kbd);
  APP_ERROR_CHECK(ret);

  app_usbd_class_inst_t const * class_inst_mouse;
//  class_inst_mouse = app_usbd_hid_mouse_class_inst_get(&m_app_hid_mouse);
  class_inst_mouse = app_usbd_hid_generic_class_inst_get(&m_app_hid_mouse);
  ret = app_usbd_class_append(class_inst_mouse);
  APP_ERROR_CHECK(ret);

  app_usbd_class_inst_t const * class_inst_extra;
  class_inst_extra = app_usbd_hid_generic_class_inst_get(&m_app_hid_extra);
  ret = app_usbd_class_append(class_inst_extra);
  APP_ERROR_CHECK(ret);

  app_usbd_class_inst_t const * class_inst_abs_mouse;
  class_inst_abs_mouse = app_usbd_hid_generic_class_inst_get(&m_app_hid_abs_mouse);
  ret = app_usbd_class_append(class_inst_abs_mouse);
  APP_ERROR_CHECK(ret);

  app_usbd_class_inst_t const * class_cdc_acm;
  class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
  ret = app_usbd_class_append(class_cdc_acm);
  APP_ERROR_CHECK(ret);

  cli_init();

  return 0;
}

int usbd_enable(void) {
  uint32_t  ret = app_usbd_power_events_enable();
  APP_ERROR_CHECK(ret);
  return ret;
}

void usbd_process(void) {
  while (app_usbd_event_queue_process()) {
    if (auto_connection_check) {
      if (auto_connection_check_cnt > 100) {
        auto_connection_check = false;
        NRF_LOG_DEBUG("auto_connection_check!");
        NRF_LOG_DEBUG("nrf_drv_usbd_is_started: %d", nrf_drv_usbd_is_started());
        NRF_LOG_DEBUG("nrf_drv_usbd_bus_suspend_check: %d", nrf_drv_usbd_bus_suspend_check());
        if (nrf_drv_usbd_is_started()) {
          if (!get_usb_enabled()) {
            if (!nrf_drv_usbd_bus_suspend_check()) { // connect to USB HOST
              select_usb(true);
              NRF_LOG_DEBUG("USB send enabled");
            } else { // connect to CHARGER
              if (!get_ble_enabled()) {
                select_ble();
                NRF_LOG_DEBUG("BLE enable");
              }
            }
          }
        } else {
          if (!get_ble_enabled()) { // USB POWER removed and battery present
            select_ble();
            NRF_LOG_DEBUG("BLE enable");
          }
        }
      } else {
        auto_connection_check_cnt++;
      }
    }
    continue;/* Nothing to do */
  }
  cli_exec();
}

int usbd_send_kbd_report(app_usbd_hid_kbd_t const *  p_kbd, report_keyboard_t *report);
int usbd_send_mouse_report(app_usbd_hid_mouse_t const *  p_mouse, report_mouse_t *report);
int usbd_send_keyboard(report_keyboard_t *report) {
  uint8_t res = usbd_send_kbd_report(&m_app_hid_kbd, report);
  NRF_LOG_DEBUG("USB send res:%d", res);

  if (nrf_drv_usbd_suspend_check()) {
    app_usbd_wakeup_req();
  }

  return res;
}

int usbd_send_mouse(report_mouse_t *report) {
//  return usbd_send_mouse_report(&m_app_hid_mouse, report);
  return app_usbd_hid_generic_in_report_set(&m_app_hid_mouse, report, 5);
}

int usbd_send_abs_mouse(int8_t x, int8_t y) {
  uint8_t report[2];
  report[0] = x;
  report[1] = y;
  return app_usbd_hid_generic_in_report_set(&m_app_hid_abs_mouse, report, 2);
}

typedef struct {
  uint8_t report_id;
  uint16_t usage;
}__attribute__ ((packed)) report_extra_t;

int usbd_send_system(uint16_t data) {
  report_extra_t report;
  report.report_id = REPORT_ID_SYSTEM;
  report.usage = data;
  uint32_t ret = app_usbd_hid_generic_in_report_set(&m_app_hid_extra, &report,
      sizeof(report_extra_t));
  NRF_LOG_INFO("Send system:%d", data);
  return ret;
}

int usbd_send_consumer(uint16_t data) {
  report_extra_t report;
  report.report_id = REPORT_ID_CONSUMER;
  report.usage = data;
  uint32_t ret = app_usbd_hid_generic_in_report_set(&m_app_hid_extra, &report,
      sizeof(report_extra_t));
  return ret;
}
